// Document Object Model (DOM) არის ობიექტთა მოდელი, რომელიც წარმოადგენს HTML დოკუმენტს როგორც აგებულებას, რომელზეც შეიძლება მოქმედება JavaScript-ის საშუალებით. DOM-ის მეშვეობით, დოკუმენტის სტრუქტურა წარმოდგენილია ქსტრუქციად, რომელშიც თითოეული HTML ელემენტი, ატრიბუტი და ტექსტური შინაარსი წარმოდგენილია ობიექტებად.


// console არის JavaScript-ის ობიექტი, რომელიც გთავაზობთ სხვადასხვა ფუნქციებს, რომ ლოგები (მონაცემები) გამოტანოთ ბრაუზერის დეველოპერულ კონსოლში. კონსოლი ძირითადად გამოიყენება პროგრამის მუშაობის მონიტორინგისთვის, დილემების გამოსავლენად ან უბრალოდ მონაცემების გამოსატანად.


// let ჩვენ იმაში გვეხმარება , რომ დავწეროთ ცვლადები

let num1 = 11;
let num2 = 12;
console.log(num1 + num2);